/*6-5까지 하면 마우스 제어 가능

6 - 2 키 눌리는거

6 - 3은 VK - BUTTON
마우스 움직이면 좌표가 찍히고 누른다
TMI : 화면 헤르츠에 맞춰서 초를 설정하면 멈춰있는것 처럼 보인다
Getcorsorpos 함수 포인터 윈도우.h에서만 제공하는 structure 함수에 커서 대놓고 f12누르면 정의로 간다 
주소값을 집어넣어서 매개변수에 직접 넣어도 값이 들어간다.
그럼 그 함수에 값을 수정하면 바뀐다.

point p가 인트타입이라 %d로 써도 가능

6-4
윈도우의 마우스 커서까지 생각해야한다.
맞추는 방법은 가로 사이즈 몇 픽셀인지랑 세로 사이즈 몇 픽셀인지 대충 넣어봐라 그럼 커서랑 꺽세랑 일치하는 위치를 찾을 수 있다 전체화면 했을때
가로 세로 왼쪽 오른쪽 갔을때 벌어지는지 안 벌어지는 지 확인하기 (전체화면에서)

마우스 커서 제어 클릭 알려줬음 오른쪽 클릭했을때 윈도우 뜨게 만들고 왼쪽 눌렀을때 드래그 하게끔 만들기

과제 내용 커서를 클릭한채로 드래그해서 오브젝트를 옮길 수 있게 하기 


상태를 많이 만들어야한다. 힌트
























*/